---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions
source: html/ca6ab5f3-4440-bbea-0177-bd764e4570cc.htm
---
# IFCExtrusionCalculatorOptions Members

Constructs a new instance of a class used to calculate extrusions from Revit geometry.